{
  "add_bos_token": false,
  "add_prefix_space": false,
  "bos_token": {
    "__type": "AddedToken",
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "__type": "AddedToken",
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "errors": "replace",
  "model_max_length": 1000000000000000019884624838656,
  "name_or_path": "NinedayWang/PolyCoder-160M",
  "pad_token": null,
  "special_tokens_map_file": "/root/.cache/huggingface/hub/models--NinedayWang--PolyCoder-160M/snapshots/a4597dd03b8ed7fbc431a3f7f34c9e568b84e31e/special_tokens_map.json",
  "tokenizer_class": "GPT2Tokenizer",
  "unk_token": {
    "__type": "AddedToken",
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  }
}
